{
  "basic_info": {
    "name": "ZuB Public Demo",
    "level": 15,
    "experience": 0,
    "avatarUrl": null,
    "inspiration": false,
    "lifestyleId": null,
    "armor_class": {
      "total": 10,
      "base": 10,
      "modifiers": [],
      "calculation": "Unarmored (10 + Dex)"
    },
    "initiative": {
      "total": 0,
      "sources": [
        {
          "source": "Dexterity",
          "value": 0
        }
      ]
    },
    "speed": {
      "walking": {
        "total": 30,
        "sources": [
          {
            "source": "Base",
            "value": 30
          }
        ]
      }
    },
    "hit_points": {
      "current": 92,
      "maximum": 92,
      "temporary": 0,
      "base": 62,
      "bonus": 0,
      "constitution_bonus": 0,
      "override": null,
      "removed": 0,
      "hit_point_type": 1,
      "hit_point_method": "Fixed"
    },
    "classes": [
      {
        "name": "Wizard",
        "level": 15,
        "hit_die": 6,
        "subclass": "School of Conjuration",
        "spellcasting_ability": "",
        "is_2024": false
      }
    ]
  },
  "appearance": {
    "gender": null,
    "age": null,
    "hair": null,
    "eyes": null,
    "skin": null,
    "height": null,
    "weight": null,
    "traits": null,
    "size": 4,
    "size_name": "Medium"
  },
  "ability_scores": {
    "strength": {
      "score": 9,
      "modifier": -1,
      "save_bonus": -1,
      "source_breakdown": {
        "base": 9
      }
    },
    "dexterity": {
      "score": 11,
      "modifier": 0,
      "save_bonus": 0,
      "source_breakdown": {
        "base": 10,
        "feat": 1
      }
    },
    "constitution": {
      "score": 14,
      "modifier": 2,
      "save_bonus": 2,
      "source_breakdown": {
        "base": 14
      }
    },
    "intelligence": {
      "score": 19,
      "modifier": 4,
      "save_bonus": 9,
      "source_breakdown": {
        "base": 17,
        "race": 1,
        "feat": 1
      }
    },
    "wisdom": {
      "score": 13,
      "modifier": 1,
      "save_bonus": 6,
      "source_breakdown": {
        "base": 12,
        "race": 1
      }
    },
    "charisma": {
      "score": 11,
      "modifier": 0,
      "save_bonus": 0,
      "source_breakdown": {
        "base": 11
      }
    }
  },
  "skills": {
    "athletics": -1,
    "acrobatics": 0,
    "sleight-of-hand": 0,
    "stealth": 0,
    "arcana": 4,
    "history": 9,
    "investigation": 9,
    "nature": 4,
    "religion": 9,
    "animal-handling": 1,
    "insight": 1,
    "medicine": 1,
    "perception": 1,
    "survival": 1,
    "deception": 0,
    "intimidation": 0,
    "performance": 0,
    "persuasion": 5
  },
  "saving_throws": {
    "strength_save": -1,
    "dexterity_save": 0,
    "constitution_save": 2,
    "intelligence_save": 9,
    "wisdom_save": 6,
    "charisma_save": 0
  },
  "proficiencies": {
    "armor": [
      "Light Armor"
    ],
    "weapons": [
      "Crossbow, Light",
      "Dagger"
    ],
    "tools": [],
    "languages": [
      "Common",
      "Draconic",
      "Dwarvish",
      "Primordial"
    ],
    "skills": [
      "History",
      "Investigation",
      "Persuasion",
      "Religion"
    ]
  },
  "proficiency_sources": {
    "Persuasion": "Species: Variant Human",
    "History": "Class: Wizard",
    "Investigation": "Class: Wizard",
    "Religion": "Background: Cloistered Scholar"
  },
  "background": {
    "name": "Cloistered Scholar",
    "description": "As a child, you were inquisitive when your playmates were possessive or raucous. In your formative years, you found your way to one of Faerûn’s great institutes of learning , where you were apprenticed and taught that knowledge is a more valuable treasure than gold or gems. Now you are ready to leave your home—not to abandon it, but to quest for new lore to add to its storehouse of knowledge. The most well known of Faerûn’s fonts of knowledge is Candlekeep. The great library is always in need of workers and attendants, some of whom rise through the ranks to assume roles of greater responsibility and prominence. You might be one of Candlekeep’s own, dedicated to the curatorship of what is likely the most complete body of lore and history in all the world. Perhaps instead you were taken in by the scholars of the Vault of the Sages or the Map House in Silverymoon, and now you have struck out to increase your knowledge and to make yourself available to help those in other places who seek your expertise. You might be one of the few who aid Herald’s Holdfast, helping to catalogue and maintain records of the information that arrives daily from across Faerûn. **Skill Proficiencies:** History, plus your choice of one from among Arcana, Nature, and Religion**Languages:** Two of your choice**Equipment:** The scholar’s robes of your cloister, a writing kit (small pouch with a quill, ink, folded parchment, and a small penknife), a borrowed book on the subject of your current study, and a pouch containing 10 gp **FEATURE: LIBRARY ACCESS** Though others must often endure extensive interviews and significant fees to gain access to even the most common archives in your library, you have free and easy access to the majority of the library, though it might also have repositories of lore that are too valuable, magical, or secret to permit anyone immediate access. You have a working knowledge of your cloister’s personnel and bureaucracy, and you know how to navigate those connections with some ease. Additionally, you are likely to gain preferential treatment at other libraries across the Realms, as professional courtesy shown to a fellow scholar. Suggested Characteristics Use the tables for the sage background below as the basis for your traits and motivations, modifying the entries when appropriate to suit your identity as a cloistered scholar. Your bond is almost certainly associated either with the place where you grew up or with the knowledge you hope to acquire through adventuring. Your ideal is no doubt related to how you view the quest for knowledge and truth—perhaps as a worthy goal in itself, or maybe as a means to a desirable end. Sage d8 Personality Trait 1 I use polysyllabic words that convey the impression of great erudition. 2 I’ve read every book in the world’s greatest libraries—or I like to boast that I have. 3 I’m used to helping out those who aren’t as smart as I am, and I patiently explain anything and everything to others. 4 There’s nothing I like more than a good mystery. 5 I’m willing to listen to every side of an argument before I make my own judgment. 6 I . . . speak . . . slowly . . . when talking . . . to idiots, . . . which . . . almost . . . everyone . . . is . . . compared . . . to me. 7 I am horribly, horribly awkward in social situations. 8 I’m convinced that people are always trying to steal my secrets. d6 Ideal 1 Knowledge. The path to power and self-improvement is through knowledge. (Neutral) 2 Beauty. What is beautiful points us beyond itself toward what is true. (Good) 3 Logic. Emotions must not cloud our logical thinking. (Lawful) 4 No Limits. Nothing should fetter the infinite possibility inherent in all existence. (Chaotic) 5 Power. Knowledge is the path to power and domination. (Evil) 6 Self-Improvement. The goal of a life of study is the betterment of oneself. (Any) d6 Bond 1 It is my duty to protect my students. 2 I have an ancient text that holds terrible secrets that must not fall into the wrong hands. 3 I work to preserve a library, university, scriptorium, or monastery. 4 My life’s work is a series of tomes related to a specific field of lore. 5 I’ve been searching my whole life for the answer to a certain question. 6 I sold my soul for knowledge. I hope to do great deeds and win it back. d6 Flaw 1 I am easily distracted by the promise of information. 2 Most people scream and run when they see a demon. I stop and take notes on its anatomy. 3 Unlocking an ancient mystery is worth the price of a civilization. 4 I overlook obvious solutions in favor of complicated ones. 5 I speak without really thinking through my words, invariably insulting others. 6 I can’t keep a secret to save my life, or anyone else’s.",
    "source_id": null,
    "is_2024": false,
    "personal_possessions": "the scholar’s robes of your cloister a quill a small penknife a borrowed book on the subject of your current study",
    "other_holdings": null,
    "organizations": null,
    "enemies": null,
    "ideals": "",
    "bonds": "",
    "flaws": "",
    "personality_traits": ""
  },
  "species": {
    "name": "Variant Human",
    "description": "",
    "size": 4,
    "source_id": null,
    "is_2024": false,
    "traits": [
      {
        "name": "Language",
        "type": "language",
        "description": "You can speak, read, and write Common",
        "language": "Common"
      },
      {
        "name": "Language",
        "type": "language",
        "description": "You can speak, read, and write Dwarvish",
        "language": "Dwarvish"
      },
      {
        "name": "Proficiency",
        "type": "proficiency",
        "description": "You have proficiency with Persuasion",
        "proficiency_type": "persuasion"
      },
      {
        "name": "Bonus",
        "type": "bonus",
        "description": "Bonus: Intelligence Score"
      },
      {
        "name": "Bonus",
        "type": "bonus",
        "description": "Bonus: Wisdom Score"
      }
    ]
  },
  "feats": [
    {
      "name": "Lightly Armored",
      "description": "You have trained to master the use of light armor, gaining the following benefits: • Increase your Strength or Dexterity score by 1, to a maximum of 20. • You gain proficiency with light armor.",
      "source": "feat:27"
    },
    {
      "name": "Lucky",
      "description": "You have inexplicable luck that seems to kick in at just the right moment. • You have 3 luck points. Whenever you make an attack roll, an ability check, or a saving throw, you can spend one luck point to roll an additional d20. You can choose to spend one of your luck points after you roll the die, but before the outcome is determined. You choose which of the d20s is used for the attack roll, ability check, or saving throw. • You can also spend one luck point when an attack roll is made against you. Roll a d20, and then choose whether the attack uses the attacker's roll or yours. If more than one creature spends a luck point to influence the outcome of a roll, the points cancel each other out; no additional dice are rolled. • You regain your expended luck points when you finish a long rest.",
      "source": "feat:29"
    },
    {
      "name": "Magic Initiate (Warlock)",
      "description": "You learn two cantrips of your choice from the warlock's spell list. • In addition, choose one 1st-level spell from the warlock's spell list. You learn that spell and can cast it at its lowest level. Once you cast it, you must finish a long rest before you can cast it again using this feat. • Charisma is your spellcasting ability for these spells.",
      "source": "feat:62"
    },
    {
      "name": "Telekinetic",
      "description": "You learn to move things with your mind, granting you the following benefits: • Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20. • You learn the mage hand cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat. • As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save.",
      "source": "feat:456458"
    },
    {
      "name": "Hero's Journey Boon",
      "description": "At your GM's discretion you can be granted a Hero's Journey Boon.",
      "source": "feat:1970713"
    },
    {
      "name": "Dark Bargain",
      "description": "At your GM's discretion, you can take a Dark Bargain.",
      "source": "feat:2048517"
    },
    {
      "name": "Racial Feat Choice",
      "description": "You gain one feat of your choice.",
      "source": "racial_trait:103"
    }
  ],
  "spells": {
    "Wizard": [
      {
        "name": "Chill Touch",
        "level": 0,
        "school": "Necromancy",
        "description": "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d8 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target. If you hit an undead target, it also has disadvantage on attack rolls against you until the end of your next turn. This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "cantrip_scaling": {
          "current_tier": 3,
          "character_level": 15,
          "scaling_levels": [
            1,
            5,
            11,
            17
          ],
          "damage_dice": "3d8",
          "damage_type": "necrotic"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "120 feet",
        "concentration": false,
        "duration": "1 round",
        "components": "V, S",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Charm Person",
        "level": 1,
        "school": "Enchantment",
        "description": "You attempt to charm a humanoid you can see within range. It must make a Wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you. ***At Higher Levels.*** When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "30 feet",
        "concentration": false,
        "duration": "1 hour",
        "components": "V, S",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Arcane Lock",
        "level": 2,
        "school": "Abjuration",
        "description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppresses this spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting **knock** on the object suppresses **arcane lock** for 10 minutes. While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "components": "V, S, M (gold dust worth at least 25 gp, which the spell consumes)",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Feign Death",
        "level": 3,
        "school": "Necromancy",
        "description": "You touch a willing creature and put it into a cataleptic state that is indistinguishable from death. For the spell’s duration, or until you use an action to touch the target and dismiss the spell, the target appears dead to all outward inspection and to spells used to determine the target’s status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell’s effect, the disease and poison have no effect until the spell ends.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": true,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "duration": "1 hour",
        "components": "V, S, M (a pinch of graveyard dirt)",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Confusion",
        "level": 4,
        "school": "Enchantment",
        "description": "This spell assaults and twists creatures' minds, spawning delusions and provoking uncontrolled action. Each creature in a 10-foot-radius sphere centered on a point you choose within range must succeed on a Wisdom saving throw when you cast this spell or be affected by it. An affected target can't take reactions and must roll a d10 at the start of each of its turns to determine its behavior for that turn. d10 Behavior 1 The creature uses all its movement to move in a random direction. To determine the direction, roll a d8 and assign a direction to each die face. The creature doesn't take an action this turn. 2-6 The creature doesn't move or take actions this turn. 7-8 The creature uses its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn. 9-10 The creature can act and move normally. At the end of each of its turns, an affected target can make a Wisdom saving throw. If it succeeds, this effect ends for that target. **At Higher Levels.** When you cast this spell using a spell slot of 5th level or higher, the radius of the sphere increases by 5 feet for each slot level above 4th.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "90 feet",
        "concentration": true,
        "duration": "Concentration",
        "components": "V, S, M (three nut shells)",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Arcane Hand",
        "level": 5,
        "school": "Evocation",
        "description": "You create a Large hand of shimmering, translucent force in an unoccupied space that you can see within range. The hand lasts for the spell's duration, and it moves at your command, mimicking the movements of your own hand. The hand is an object that has AC 20 and hit points equal to your hit point maximum. If it drops to 0 hit points, the spell ends. It has a Strength of 26 (+8) and a Dexterity of 10 (+0). The hand doesn't fill its space. When you cast the spell and as a bonus action on your subsequent turns, you can move the hand up to 60 feet and then cause one of the following effects with it. ***Clenched Fist.*** The hand strikes one creature or object within 5 feet of it. Make a melee spell attack for the hand using your game statistics. On a hit, the target takes 4d8 force damage. ***Forceful Hand.*** The hand attempts to push a creature within 5 feet of it in a direction you choose. Make a check with the hand's Strength contested by the Strength (Athletics) check of the target. If the target is Medium or smaller, you have advantage on the check. If you succeed, the hand pushes the target up to 5 feet plus a number of feet equal to five times your spellcasting ability modifier. The hand moves with the target to remain within 5 feet of it. ***Grasping Hand.*** The hand attempts to grapple a Huge or smaller creature within 5 feet of it. You use the hand's Strength score to resolve the grapple. If the target is Medium or smaller, you have advantage on the check. While the hand is grappling the target, you can use a bonus action to have the hand crush it. When you do so, the target takes bludgeoning damage equal to 2d6 + your spellcasting ability modifier. ***Interposing Hand.*** The hand interposes itself between you and a creature you choose until you give the hand a different command. The hand moves to stay between you and the target, providing you with half cover against the target. The target can't move through the hand's space if its Strength score is less than or equal to the hand's Strength score. If its Strength score is higher than the hand's Strength score, the target can move toward you through the hand's space, but that space is difficult terrain for the target. ***At Higher Levels.*** When you cast this spell using a spell slot of 6th level or higher, the damage from the clenched fist option increases by 2d8 and the damage from the grasping hand increases by 2d6 for each slot level above 5th.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "120 feet",
        "concentration": true,
        "duration": "Concentration",
        "components": "V, S, M (an eggshell and a snakeskin glove)",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Disintegrate",
        "level": 6,
        "school": "Transmutation",
        "description": "A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by **wall of force**. A creature targeted by this spell must make a Dexterity saving throw. On a failed save, the target takes 10d6 + 40 force damage. The target is disintegrated if this damage leaves it with 0 hit points. A disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a **true resurrection** or a **wish** spell. This spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot- cube portion of it. A magic item is unaffected by this spell. ***At Higher Levels.*** When you cast this spell using a spell slot of 7th level or higher, the damage increases by 3d6 for each slot level above 6th.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "60 feet",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S, M (a lodestone and a pinch of dust)",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Etherealness",
        "level": 7,
        "school": "Transmutation",
        "description": "You step into the border regions of the Ethereal Plane, in the area where it overlaps with your current plane. You remain in the Border Ethereal for the duration or until you use your action to dismiss the spell. During this time, you can move in any direction. If you move up or down, every foot of movement costs an extra foot. You can see and hear the plane you originated from, but everything there looks gray, and you can't see anything more than 60 feet away. While on the Ethereal Plane, you can only affect and be affected by other creatures on that plane. Creatures that aren't on the Ethereal Plane can't perceive you and can't interact with you, unless a special ability or magic has given them the ability to do so. You ignore all objects and effects that aren't on the Ethereal Plane, allowing you to move through objects you perceive on the plane you originated from. When the spell ends, you immediately return to the plane you originated from in the spot you currently occupy. If you occupy the same spot as a solid object or creature when this happens, you are immediately shunted to the nearest unoccupied space that you can occupy and take force damage equal to twice the number of feet you are moved. This spell has no effect if you cast it while you are on the Ethereal Plane or a plane that doesn't border it, such as one of the Outer Planes. ***At Higher Levels.*** When you cast this spell using a spell slot of 8th level or higher, you can target up to three willing creatures (including you) for each slot level above 7th. The creatures must be within 10 feet of you when you cast the spell.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "duration": "8 hours",
        "components": "V, S",
        "sources": [
          "Wizard"
        ]
      },
      {
        "name": "Incendiary Cloud",
        "level": 8,
        "school": "Conjuration",
        "description": "A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius sphere centered on a point within range. The cloud spreads around corners and is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it. When the cloud appears, each creature in it must make a Dexterity saving throw. A creature takes 10d8 fire damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or ends its turn there. The cloud moves 10 feet directly away from you in a direction that you choose at the start of each of your turns.",
        "save_dc": 17,
        "attack_bonus": 9,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": true,
        "effective_prepared": true,
        "ritual": false,
        "preparation_type": "prepared_from_book",
        "usage_type": "slot",
        "source_info": {
          "class": "Wizard",
          "feature": "Class Spell",
          "granted_by": "Wizard spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "150 feet",
        "concentration": true,
        "duration": "Concentration",
        "components": "V, S",
        "sources": [
          "Wizard"
        ]
      }
    ],
    "Feat": [
      {
        "name": "Mage Hand",
        "level": 0,
        "school": "Conjuration",
        "description": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration or until you dismiss it as an action. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again. You can use your action to control the hand. You can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial. You can move the hand up to 30 feet each time you use it. The hand can't attack, activate magic items, or carry more than 10 pounds.",
        "save_dc": 13,
        "attack_bonus": 5,
        "spellcasting_ability": "charisma",
        "always_prepared": true,
        "usage_type": "at-will",
        "source_info": {
          "class": "Feat",
          "feature": "Feat Grant",
          "granted_by": "Character feat"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "30 feet",
        "ritual": false,
        "concentration": false,
        "duration": "1 minute",
        "components": "V, S",
        "sources": [
          "Feat",
          "Feat"
        ]
      },
      {
        "name": "Friends",
        "level": 0,
        "school": "Enchantment",
        "description": "For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn’t hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM’s discretion), depending on the nature of your interaction with it.",
        "save_dc": 13,
        "attack_bonus": 5,
        "spellcasting_ability": "charisma",
        "always_prepared": true,
        "usage_type": "at-will",
        "source_info": {
          "class": "Feat",
          "feature": "Feat Grant",
          "granted_by": "Character feat"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "ritual": false,
        "concentration": true,
        "duration": "Concentration",
        "components": "S, M (a small amount of makeup applied to the face as this spell is cast)",
        "sources": [
          "Feat"
        ]
      },
      {
        "name": "Arms of Hadar",
        "level": 1,
        "school": "Conjuration",
        "description": "You invoke the power of Hadar, the Dark Hunger. Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can’t take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect. **At Higher Levels. **When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
        "save_dc": 13,
        "attack_bonus": 5,
        "spellcasting_ability": "charisma",
        "always_prepared": true,
        "usage_type": "per-rest",
        "source_info": {
          "class": "Feat",
          "feature": "Feat Grant",
          "granted_by": "Character feat"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "ritual": false,
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S",
        "sources": [
          "Feat"
        ]
      }
    ]
  },
  "spell_slots": {
    "regular_slots": {
      "level_1": 4,
      "level_2": 3,
      "level_3": 3,
      "level_4": 3,
      "level_5": 2,
      "level_6": 1,
      "level_7": 1,
      "level_8": 1
    },
    "pact_slots": {},
    "caster_level": 15,
    "level_1": 4,
    "level_2": 3,
    "level_3": 3,
    "level_4": 3,
    "level_5": 2,
    "level_6": 1,
    "level_7": 1,
    "level_8": 1
  },
  "actions": [
    {
      "name": "Arcane Recovery",
      "description": "",
      "type": "class",
      "snippet": "Once per day when you finish a short rest, you can choose expended spell slots to recover - up to a combined level of {{(classlevel/2)@roundup}}, and none of the slots can be 6th level or higher."
    },
    {
      "name": "Benign Transposition",
      "description": "Starting at 6th level, you can use your action to teleport up to 30 feet to an unoccupied space that you can see. Alternatively, you can choose a space within range that is occupied by a Small or Medium creature. If that creature is willing, you both teleport, swapping places. Once you use this feature, you can’t use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher.",
      "type": "class",
      "snippet": "You can use your action to teleport up to 30 ft. to an unoccupied space that you can see, or you can choose to swap places with a Small or Medium willing creature within range. Once you use this feature, you can’t use it again until you finish a long rest or you cast a conjuration spell of 1st level or higher."
    },
    {
      "name": "Cantrip Formulas",
      "description": "*3rd-level wizard feature* You have scribed a set of arcane formulas in your spellbook that you can use to formulate a cantrip in your mind. Whenever you finish a long rest and consult those formulas in your spellbook, you can replace one wizard cantrip you know with another cantrip from the wizard spell list.",
      "type": "class",
      "snippet": "You have scribed a set of arcane formulas in your spellbook that you can use to formulate a cantrip in your mind. Whenever you finish a long rest and consult those formulas in your spellbook, you can replace one wizard cantrip you know with another cantrip from the wizard spell list."
    },
    {
      "name": "Minor Conjuration",
      "description": null,
      "type": "class",
      "snippet": "You can use your action to conjure up an inanimate object (no larger than 3 ft. on a side and no more than 10 lb.) in your hand or in an unoccupied space that you can see within 10 ft. of you. The object disappears after 1 hour, when you use this feature again, or if it takes or deals any damage."
    },
    {
      "name": "Lucky",
      "description": "",
      "type": "feat",
      "snippet": "You have 3 luck points per long rest. Whenever you make an attack roll, an ability check, or a saving throw (or when an attack roll is made against you), you can spend one to roll an additional d20 and you choose which die to use. You can choose to spend luck points after you roll the die, but before the outcome is determined."
    },
    {
      "name": "Telekinetic: Shove",
      "description": "You learn to move things with your mind, granting you the following benefits: • Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 20. • You learn the [spell]mage hand[/spell] cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand invisible. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat. • As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save.",
      "type": "feat",
      "snippet": "As a bonus action, you can try to telekinetically shove one creature you can see within 30 ft. of you. When you do so, the target must succeed on a Strength saving throw (DC {{savedc:int}}) or be moved 5 ft. toward or away from you. A creature can willingly fail this save."
    }
  ],
  "inventory": [
    {
      "name": "Dagger",
      "quantity": 1,
      "equipped": true,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Dagger",
      "rarity": "Common"
    },
    {
      "name": "Dagger",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Dagger",
      "rarity": "Common"
    },
    {
      "name": "Quarterstaff",
      "quantity": 1,
      "equipped": true,
      "attuned": false,
      "requires_attunement": false,
      "weight": 4.0,
      "type": "Quarterstaff",
      "rarity": "Common"
    },
    {
      "name": "Ink (1 ounce bottle)",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Parchment (one sheet)",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Spellbook",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 3.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Backpack",
      "quantity": 1,
      "equipped": true,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Robe",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 4.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Oil",
      "quantity": 10,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Parchment",
      "quantity": 10,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Tinderbox",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Book",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Lamp",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Ink Pen",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Ink",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    }
  ],
  "notes": {
    "character_notes": "",
    "allies": null,
    "backstory": null,
    "personal_traits": "",
    "ideals": "",
    "bonds": "",
    "flaws": ""
  },
  "meta": {
    "character_id": "147061783",
    "is_2024_rules": false,
    "processed_timestamp": 1751226303.106847,
    "scraper_version": "5.2.0",
    "proficiency_bonus": 5,
    "primary_spellcasting_ability": "intelligence",
    "passive_senses": {
      "perception": 11,
      "investigation": 19,
      "insight": 11
    },
    "total_wealth_gp": 15,
    "carrying_capacity": 135,
    "total_caster_level": 15,
    "individual_currencies": {
      "copper": 0,
      "silver": 0,
      "electrum": 0,
      "gold": 15,
      "platinum": 0
    },
    "diagnostics": {
      "errors": [],
      "warnings": [],
      "missing_data": [],
      "info": [
        "Found 1 classSpells entries with 9 total spells",
        "Found feats from 6 direct + 0 background sources"
      ],
      "data_analysis": [
        "Proficiency sources: race:1, class:9, background:2, feat:1"
      ],
      "expected_vs_actual": []
    }
  }
}