{
  "basic_info": {
    "name": "Vaelith Duskthorn",
    "level": 2,
    "experience": 0,
    "avatarUrl": "https://www.dndbeyond.com/avatars/48670/576/1581111423-144986992.jpeg?width=150&height=150&fit=crop&quality=95&auto=webp",
    "inspiration": false,
    "lifestyleId": null,
    "armor_class": {
      "total": 12,
      "base": 10,
      "modifiers": [
        {
          "source": "Dexterity",
          "value": 2,
          "type": "ability"
        }
      ],
      "calculation": "Unarmored (10 + Dex)"
    },
    "initiative": {
      "total": 2,
      "sources": [
        {
          "source": "Dexterity",
          "value": 2
        }
      ]
    },
    "speed": {
      "walking": {
        "total": 30,
        "sources": [
          {
            "source": "Base",
            "value": 30
          }
        ]
      }
    },
    "hit_points": {
      "current": 13,
      "maximum": 13,
      "temporary": 0,
      "base": 11,
      "bonus": 0,
      "constitution_bonus": 2,
      "override": null,
      "removed": 0,
      "hit_point_type": 2,
      "hit_point_method": "Manual"
    },
    "classes": [
      {
        "name": "Sorcerer",
        "level": 2,
        "hit_die": 6,
        "subclass": "",
        "spellcasting_ability": "",
        "is_2024": true
      }
    ]
  },
  "appearance": {
    "gender": "Female",
    "age": 26,
    "hair": "Long flowing ebony black.",
    "eyes": "Piercing electric blue.",
    "skin": "Pale (untouched by sun)",
    "height": "6ft",
    "weight": null,
    "traits": null,
    "size": 4,
    "size_name": "Medium"
  },
  "ability_scores": {
    "strength": {
      "score": 12,
      "modifier": 1,
      "save_bonus": 1,
      "source_breakdown": {
        "base": 10,
        "race": 2
      }
    },
    "dexterity": {
      "score": 14,
      "modifier": 2,
      "save_bonus": 2,
      "source_breakdown": {
        "base": 14
      }
    },
    "constitution": {
      "score": 12,
      "modifier": 1,
      "save_bonus": 3,
      "source_breakdown": {
        "base": 12
      }
    },
    "intelligence": {
      "score": 12,
      "modifier": 1,
      "save_bonus": 1,
      "source_breakdown": {
        "base": 12
      }
    },
    "wisdom": {
      "score": 6,
      "modifier": -2,
      "save_bonus": -2,
      "source_breakdown": {
        "base": 6
      }
    },
    "charisma": {
      "score": 18,
      "modifier": 4,
      "save_bonus": 6,
      "source_breakdown": {
        "base": 17,
        "race": 1
      }
    }
  },
  "skills": {
    "athletics": 1,
    "acrobatics": 2,
    "sleight-of-hand": 2,
    "stealth": 2,
    "arcana": 3,
    "history": 3,
    "investigation": 1,
    "nature": 1,
    "religion": 1,
    "animal-handling": -2,
    "insight": -2,
    "medicine": -2,
    "perception": 0,
    "survival": -2,
    "deception": 4,
    "intimidation": 6,
    "performance": 4,
    "persuasion": 6
  },
  "saving_throws": {
    "strength_save": 1,
    "dexterity_save": 2,
    "constitution_save": 3,
    "intelligence_save": 1,
    "wisdom_save": -2,
    "charisma_save": 6
  },
  "proficiencies": {
    "armor": [],
    "weapons": [
      "Simple Weapons"
    ],
    "tools": [
      "Dragonchess Set"
    ],
    "languages": [
      "Common",
      "Draconic",
      "Elvish",
      "Orc"
    ],
    "skills": [
      "Arcana",
      "History",
      "Intimidation",
      "Perception",
      "Persuasion"
    ]
  },
  "proficiency_sources": {
    "Perception": "Species: Elf",
    "Arcana": "Class: Sorcerer",
    "Intimidation": "Class: Sorcerer",
    "History": "Background: Noble",
    "Persuasion": "Background: Noble"
  },
  "background": {
    "name": "Noble",
    "description": "You understand wealth, power, and privilege. You carry a noble title, and your family owns land, collects taxes, and wields significant political influence. You might be a pampered aristocrat unfamiliar with work or discomfort, a former merchant just elevated to the nobility, or a disinherited scoundrel with a disproportionate sense of entitlement. Or you could be an honest, hard-working landowner who cares deeply about the people who live and work on your land, keenly aware of your responsibility to them. Work with your DM to come up with an appropriate title and determine how much authority that title carries. A noble title doesn’t stand on its own—it’s connected to an entire family, and whatever title you hold, you will pass it down to your own children. Not only do you need to determine your noble title, but you should also work with the DM to describe your family and their influence on you. Is your family old and established, or was your title only recently bestowed? How much influence do they wield, and over what area? What kind of reputation does your family have among the other aristocrats of the region? How do the common people regard them? What’s your position in the family? Are you the heir to the head of the family? Have you already inherited the title? How do you feel about that responsibility? Or are you so far down the line of inheritance that no one cares what you do, as long as you don’t embarrass the family? How does the head of your family feel about your adventuring career? Are you in your family’s good graces, or shunned by the rest of your family? Does your family have a coat of arms? An insignia you might wear on a signet ring? Particular colors you wear all the time? An animal you regard as a symbol of your line or even a spiritual member of the family? These details help establish your family and your title as features of the world of the campaign. **Skill Proficiencies:** History, Persuasion **Tool Proficiencies:** One type of gaming set **Languages:** One of your choice **Equipment:** A set of fine clothes, a signet ring, a scroll of pedigree, and a purse containing 25 gp Feature: Position of Privelege Thanks to your noble birth, people are inclined to think the best of you. You are welcome in high society, and people assume you have the right to be wherever you are. The common folk make every effort to accommodate you and avoid your displeasure, and other people of high birth treat you as a member of the same social sphere. You can secure an audience with a local noble if you need to. Variant Noble: Knight A knighthood is among the lowest noble titles in most societies, but it can be a path to higher status. If you wish to be a knight, choose the Retainers feature (see the sidebar) instead of the Position of Privilege feature. One of your commoner retainers is replaced by a noble who serves as your squire, aiding you in exchange for training on his or her own path to knighthood. Your two remaining retainers might include a groom to care for your horse and a servant who polishes your armor (and even helps you put it on). As an emblem of chivalry and the ideals of courtly love, you might include among your equipment a banner or other token from a noble lord or lady to whom you have given your heart—in a chaste sort of devotion. (This person could be your bond.) Variant Feature: Retainers If your character has a noble background, you may select this background feature instead of Position of Privilege. You have the service of three retainers loyal to your family. These retainers can be attendants or messengers, and one might be a majordomo. Your retainers are commoners who can perform mundane tasks for you, but they do not fight for you, will not follow you into obviously dangerous areas (such as dungeons), and will leave if they are frequently endangered or abused",
    "source_id": null,
    "is_2024": true,
    "personal_possessions": "Item: Vaelith’s Silver Nail File Type: Personal Item Weight: Negligible Description: A sleek, finely-crafted silver nail file — polished to a mirror sheen and engraved along the handle with the subtle, curling sigil of House Duskthorn. Embedded at the base of the handle sits a flawless 1-carat diamond, catching the light with cold, perfect clarity. The file was a gift from her mother — once a simple token of elegance, now the last thread that binds her to a family that cast her aside. Though designed for the meticulous care of her long, black-painted nails, the file’s pointed tip has been discreetly sharpened beyond mere vanity. More than an accessory, it serves as both a quiet weapon and a symbol: her family shaped her into something elegant, sharp and dangerous. a scroll of pedigree",
    "other_holdings": null,
    "organizations": "House Duskthorn (Former Affiliation) — The highborn elven family she was born into. — Cold, political, and image-obsessed, they value reputation over truth. — After the betrayal and their refusal to believe her, she abandoned them. Some of them might still watch her from the shadows, either out of guilt… or to protect their name.",
    "enemies": "Lord Thalen Rhyvaris (The Betrayer) — The man who wronged her. Charming, calculating, and utterly self-serving. He lied and turned her family against her when she needed them most. — Highborn, politically protected, still out there. Their unfinished business is the quiet storm behind her sharpness.",
    "ideals": "",
    "bonds": "",
    "flaws": "",
    "personality_traits": ""
  },
  "species": {
    "name": "Elf",
    "description": "",
    "size": 4,
    "source_id": null,
    "is_2024": true,
    "traits": [
      {
        "name": "Sense",
        "type": "sense",
        "description": "You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light.",
        "sense_type": "darkvision",
        "range": 60
      },
      {
        "name": "Advantage",
        "type": "advantage",
        "description": "You have advantage on Saving Throws checks"
      },
      {
        "name": "Proficiency",
        "type": "proficiency",
        "description": "You have proficiency with Perception",
        "proficiency_type": "perception"
      },
      {
        "name": "Immunity",
        "type": "immunity",
        "description": "You have immunity to Magical Sleep",
        "immunity_type": "magical-sleep"
      },
      {
        "name": "Language",
        "type": "language",
        "description": "You can speak, read, and write Common",
        "language": "Common"
      },
      {
        "name": "Language",
        "type": "language",
        "description": "You can speak, read, and write Draconic",
        "language": "Draconic"
      },
      {
        "name": "Language",
        "type": "language",
        "description": "You can speak, read, and write Orc",
        "language": "Orc"
      },
      {
        "name": "Bonus",
        "type": "bonus",
        "description": "Bonus: Strength Score"
      },
      {
        "name": "Bonus",
        "type": "bonus",
        "description": "Bonus: Charisma Score"
      },
      {
        "name": "Racial Spells",
        "type": "spellcasting",
        "description": "Spells granted by racial heritage: Prestidigitation"
      }
    ]
  },
  "feats": [],
  "spells": {
    "Sorcerer": [
      {
        "name": "Sorcerous Burst",
        "level": 0,
        "school": "Evocation",
        "description": "You cast sorcerous energy at one creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d8 damage of a type you choose: Acid, Cold, Fire, Lightning, Poison, Psychic, or Thunder. If you roll an 8 on a d8 for this spell, you can roll another d8, and add it to the damage. When you cast this spell, the maximum number of these d8s you can add to the spell’s damage equals your spellcasting ability modifier. ***Cantrip Upgrade.*** The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8).",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "cantrip_scaling": {
          "current_tier": 1,
          "character_level": 2,
          "scaling_levels": [
            1,
            5,
            11,
            17
          ],
          "damage_dice": "1d8",
          "damage_type": "variable"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "120 feet",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "Shield",
        "level": 1,
        "school": "Abjuration",
        "description": "An imperceptible barrier of magical force protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from Magic Missile.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 1 Minute",
        "range": "Special",
        "concentration": false,
        "duration": "1 round",
        "components": "V, S",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "Message",
        "level": 0,
        "school": "Transmutation",
        "description": "You point toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear. You can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence; 1 foot of stone, metal, or wood; or a thin sheet of lead blocks the spell.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "120 feet",
        "concentration": false,
        "duration": "1 round",
        "components": "S, M (a copper wire)",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "Minor Illusion",
        "level": 0,
        "school": "Illusion",
        "description": "You create a sound or an image of an object within range that lasts for the duration. See the descriptions below for the effects of each. The illusion ends if you cast this spell again. If a creature takes a Study action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature. **Sound.** If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends. **Image.** If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot Cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, since things can pass through it.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "30 feet",
        "concentration": false,
        "duration": "1 minute",
        "components": "S, M (a bit of fleece)",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "True Strike",
        "level": 0,
        "school": "Divination",
        "description": "Guided by a flash of magical insight, you make one attack with the weapon used in the spell’s casting. The attack uses your spellcasting ability for the attack and damage rolls instead of using Strength or Dexterity. If the attack deals damage, it can be Radiant damage or the weapon’s normal damage type (your choice). **Cantrip Upgrade.** Whether you deal Radiant damage or the weapon’s normal damage type, the attack deals extra Radiant damage when you reach levels 5 (1d6), 11 (2d6), and 17 (3d6).",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "cantrip_scaling": {
          "current_tier": 1,
          "character_level": 2,
          "scaling_levels": [
            1,
            5,
            11,
            17
          ],
          "enhanced_scaling": true,
          "extra_damage": "0"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "S, M (a weapon with which you have proficiency and that is worth 1+ CP)",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "Thunderwave",
        "level": 1,
        "school": "Evocation",
        "description": "You unleash a wave of thunderous energy. Each creature in a 15-foot Cube originating from you makes a Constitution saving throw. On a failed save, a creature takes 2d8 Thunder damage and is pushed 10 feet away from you. On a successful save, a creature takes half as much damage only. In addition, unsecured objects that are entirely within the Cube are pushed 10 feet away from you, and a thunderous boom is audible within 300 feet. **Using a Higher-Level Spell Slot.** The damage increases by 1d8 for each spell slot level above 1.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "Chromatic Orb",
        "level": 1,
        "school": "Evocation",
        "description": "You hurl an orb of energy at a target within range. Choose Acid, Cold, Fire, Lightning, Poison, or Thunder for the type of orb you create, and then make a ranged spell attack against the target. On a hit, the target takes 3d8 damage of the chosen type. If you roll the same number on two or more of the d8s, the orb leaps to a different target of your choice within 30 feet of the target. Make an attack roll against the new target, and make a new damage roll. The orb can’t leap again unless you cast the spell with a level 2+ spell slot. **Using a Higher-Level Spell Slot.** The damage increases by 1d8 for each spell slot level above 1. The orb can leap a maximum number of times equal to the level of the slot expended, and a creature can be targeted only once by each casting of this spell.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "90 feet",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S, M (a diamond worth 50+ GP)",
        "sources": [
          "Sorcerer"
        ]
      },
      {
        "name": "False Life",
        "level": 1,
        "school": "Necromancy",
        "description": "You gain 2d4 + 4 Temporary Hit Points. **Using a Higher-Level Spell Slot.** You gain 5 additional Temporary Hit Points for each spell slot level above 1.",
        "save_dc": 11,
        "attack_bonus": 3,
        "spellcasting_ability": "intelligence",
        "always_prepared": false,
        "is_prepared": false,
        "effective_prepared": false,
        "ritual": false,
        "preparation_type": "known",
        "usage_type": "slot",
        "source_info": {
          "class": "Sorcerer",
          "feature": "Class Spell",
          "granted_by": "Sorcerer spell list"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "Special",
        "concentration": false,
        "duration": "Instantaneous",
        "components": "V, S, M (a drop of alcohol)",
        "sources": [
          "Sorcerer"
        ]
      }
    ],
    "Racial": [
      {
        "name": "Prestidigitation",
        "level": 0,
        "school": "Transmutation",
        "description": "You create a magical effect within range. Choose the effect from the options below. If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time. **Sensory Effect.** You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor. **Fire Play.** You instantaneously light or snuff out a candle, a torch, or a small campfire. **Clean or Soil.** You instantaneously clean or soil an object no larger than 1 cubic foot. **Minor Sensation.** You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour. **Magic Mark.** You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour. **Minor Creation.** You create a nonmagical trinket or an illusory image that can fit in your hand. It lasts until the end of your next turn. A trinket can deal no damage and has no monetary worth.",
        "save_dc": 14,
        "attack_bonus": 6,
        "spellcasting_ability": "charisma",
        "always_prepared": true,
        "usage_type": "at-will",
        "source_info": {
          "class": "Racial",
          "feature": "Racial Trait",
          "granted_by": "Species heritage"
        },
        "data_source": "A",
        "casting_time": "1 Action",
        "range": "10 feet",
        "ritual": false,
        "concentration": false,
        "duration": "1 hour",
        "components": "V, S",
        "sources": [
          "Racial"
        ]
      }
    ]
  },
  "spell_slots": {
    "regular_slots": {
      "level_1": 3
    },
    "pact_slots": {},
    "caster_level": 2,
    "level_1": 3
  },
  "actions": [
    {
      "name": "Innate Sorcery",
      "description": "An event in your past left an indelible mark on you, infusing you with simmering magic. As a Bonus Action, you can unleash that magic for 1 minute, during which you gain the following benefits: • The spell save DC of your Sorcerer spells increases by 1. • You have Advantage on the attack rolls of Sorcerer spells you cast. You can use this feature twice, and you regain all expended uses of it when you finish a Long Rest.",
      "type": "class",
      "snippet": "Twice per Long Rest, you can take a Bonus Action to unleash the simmering magic within you for 1 minute."
    },
    {
      "name": "Font of Magic: Sorcery Points",
      "description": "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects. You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table. You can’t have more Sorcery Points than the number shown in the table for your level. You regain all expended Sorcery Points when you finish a Long Rest. You can use your Sorcery Points to fuel the options below, along with other features, such as Metamagic, that use those points. **Converting Spell Slots to Sorcery Points.** You can expend a spell slot to gain a number of Sorcery Points equal to the slot’s level (no action required). **Creating Spell Slots.** As a Bonus Action, you can transform unexpended Sorcery Points into one spell slot. The Creating Spell Slots table shows the cost of creating a spell slot of a given level, and it lists the minimum Sorcerer level you must be to create a slot. You can create a spell slot no higher than level 5. Any spell slot you create with this feature vanishes when you finish a Long Rest. Creating Spell Slots Spell Slot Level Sorcery Point Cost Min. Sorcerer Level 1 2 2 2 3 3 3 5 5 4 6 7 5 7 9",
      "type": "class",
      "snippet": "You can tap into the wellspring of magic within yourself, which is represented by Sorcery Points (SP). Sorcery Points fuel various magical effects. You have {{limiteduse}} SP and regain all expended points when you finish a Long Rest."
    },
    {
      "name": "Font of Magic: Convert Spell Slots",
      "description": "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects. You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table. You can’t have more Sorcery Points than the number shown in the table for your level. You regain all expended Sorcery Points when you finish a Long Rest. You can use your Sorcery Points to fuel the options below, along with other features, such as Metamagic, that use those points. **Converting Spell Slots to Sorcery Points.** You can expend a spell slot to gain a number of Sorcery Points equal to the slot’s level (no action required). **Creating Spell Slots.** As a Bonus Action, you can transform unexpended Sorcery Points into one spell slot. The Creating Spell Slots table shows the cost of creating a spell slot of a given level, and it lists the minimum Sorcerer level you must be to create a slot. You can create a spell slot no higher than level 5. Any spell slot you create with this feature vanishes when you finish a Long Rest. Creating Spell Slots Spell Slot Level Sorcery Point Cost Min. Sorcerer Level 1 2 2 2 3 3 3 5 5 4 6 7 5 7 9",
      "type": "class",
      "snippet": "You can expend a spell slot to gain a number of Sorcery Points equal to the slot’s level (no action required)."
    },
    {
      "name": "Font of Magic: Create Spell Slot Level 1",
      "description": "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects. You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table. You can’t have more Sorcery Points than the number shown in the table for your level. You regain all expended Sorcery Points when you finish a Long Rest. You can use your Sorcery Points to fuel the options below, along with other features, such as Metamagic, that use those points. **Converting Spell Slots to Sorcery Points.** You can expend a spell slot to gain a number of Sorcery Points equal to the slot’s level (no action required). **Creating Spell Slots.** As a Bonus Action, you can transform unexpended Sorcery Points into one spell slot. The Creating Spell Slots table shows the cost of creating a spell slot of a given level, and it lists the minimum Sorcerer level you must be to create a slot. You can create a spell slot no higher than level 5. Any spell slot you create with this feature vanishes when you finish a Long Rest. Creating Spell Slots Spell Slot Level Sorcery Point Cost Min. Sorcerer Level 1 2 2 2 3 3 3 5 5 4 6 7 5 7 9",
      "type": "class",
      "snippet": "You can transform 2 unexpended Sorcery Points into a level 1 spell slot, which vanishes when you finish a Long Rest."
    },
    {
      "name": "Metamagic: Twinned Spell",
      "description": "*Cost: 1 Sorcery Point* When you cast a spell, such as [spells]Charm Person[/spells], that can be cast with a higher-level spell slot to target an additional creature, you can spend 1 Sorcery Point to increase the spell’s effective level by 1.",
      "type": "class",
      "snippet": "When you cast a spell that can be cast with a higher-level spell slot to target an additional creature, you can spend 1 Sorcery Point to increase the spell’s effective level by 1."
    },
    {
      "name": "Metamagic: Careful Spell",
      "description": "*Cost: 1 Sorcery Point* When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell’s full force. To do so, spend 1 Sorcery Point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell, and it takes no damage if it would normally take half damage on a successful save.",
      "type": "class",
      "snippet": "When you cast a spell that forces other creatures to make a saving throw, you can spend 1 Sorcery Point and choose up to {{modifier:cha@min:1#unsigned}} creatures to automatically succeed on its saving throw, and it takes no damage if it would normally take half damage on a success."
    }
  ],
  "inventory": [
    {
      "name": "Potion of Healing",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.5,
      "type": "Potion",
      "rarity": "Common"
    },
    {
      "name": "Dagger",
      "quantity": 1,
      "equipped": true,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Dagger",
      "rarity": "Common"
    },
    {
      "name": "Dagger",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Dagger",
      "rarity": "Common"
    },
    {
      "name": "Spear",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 3.0,
      "type": "Spear",
      "rarity": "Common"
    },
    {
      "name": "Clothes, Fine",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 6.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Signet Ring",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 0.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Backpack",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Crystal",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Oil",
      "quantity": 2,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Rations",
      "quantity": 10,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 2.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Rope",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Tinderbox",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Torch",
      "quantity": 10,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 1.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Waterskin",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Caltrops",
      "quantity": 20,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 2.0,
      "type": "Gear",
      "rarity": "Common"
    },
    {
      "name": "Crowbar",
      "quantity": 1,
      "equipped": false,
      "attuned": false,
      "requires_attunement": false,
      "weight": 5.0,
      "type": "Gear",
      "rarity": "Common"
    }
  ],
  "notes": {
    "character_notes": "",
    "allies": " Eryndor Veylin (Old Tutor)\n— A stern but kind-hearted elven mage who taught her the basics of control before her power truly awakened.\n— The only person from her old life she still has any fondness for — though she’d never admit it.",
    "backstory": "Born into the ancient and unyielding House Duskthorn, Vaelith grew up wrapped in silks, duty, and suffocating expectation. Her family prized status and image above all else, molding her into the perfect noble daughter — obedient, elegant, and silent. But fate had other plans.\n\nWhen her innate sorcerous power first sparked, it was seen as an asset, a rare gift to parade at court — until the day she uncovered a betrayal so deep it shattered the world she knew. A nobleman she once trusted, a man who had charmed his way past her walls, wronged her in the worst way, only to twist the truth before her family could ever hold him accountable. His lies were silver-tongued, his reputation untouchable — and House Duskthorn, ever loyal to their image above all, branded her a liar.\n\nThe wound cut deeper than any blade. Cast out by the only people who should have stood at her side, Vaelith left with nothing but a handful of stolen coin, her sharpened will, her growing command over lightning, and an iron vow to carve her own name into history — on her terms, not theirs.\n\nThe last of her gold bought her a place aboard a nameless ship, its sails fat with wind and bound for the forgotten edges of the world. For now, she needs coin to survive. But her true hunger is for power — enough to command the respect her family denied her, enough to make the world swallow every bitter word they ever dared speak against her.\n\nShe walks the world with a storm behind her eyes and a resting expression cold enough to kill. Her nails — long, sharp, and meticulously painted black — are as much a weapon as her magic, and she wears them like a queen wears a crown: a quiet, permanent reminder that she doesn’t need steel to draw blood.\n\nTo the world, she is cold, calculating, and unapproachable. But beneath the sharp edges lies a heart that still burns — for freedom, for justice, and for the protection of those few souls worthy of her trust.\n\nWrong her, and you’ll regret it. Betray her, and you’ll wish she’d chosen lightning. And should the man who shattered her life cross her path again… death would be too kind a fate.",
    "personal_traits": "",
    "ideals": "",
    "bonds": "",
    "flaws": ""
  },
  "meta": {
    "character_id": "144986992",
    "is_2024_rules": true,
    "processed_timestamp": 1751226294.6118646,
    "scraper_version": "5.2.0",
    "proficiency_bonus": 2,
    "primary_spellcasting_ability": "charisma",
    "passive_senses": {
      "perception": 10,
      "investigation": 11,
      "insight": 8
    },
    "total_wealth_gp": 110,
    "carrying_capacity": 180,
    "total_caster_level": 2,
    "individual_currencies": {
      "copper": 0,
      "silver": 17,
      "electrum": 0,
      "gold": 109,
      "platinum": 0
    },
    "diagnostics": {
      "errors": [],
      "warnings": [
        "No feats found in any source"
      ],
      "missing_data": [],
      "info": [
        "Found 1 classSpells entries with 8 total spells"
      ],
      "data_analysis": [
        "Proficiency sources: race:1, class:5, background:3"
      ],
      "expected_vs_actual": []
    }
  }
}